Revit 2026 API

# EnergyDataSettingsOutsideAirPerArea Property

---

The rate of flow of outside air available per unit area.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double OutsideAirPerArea { get; set; }
```
```vb
Public Property OutsideAirPerArea As Double
	Get
	Set
```
```cpp
public:
property double OutsideAirPerArea {
	double get ();
	void set (double value);
}
```
```fsharp
member OutsideAirPerArea : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The outside airPerArea does not fall within an appropriate range. |

Stored in cubic feet per hour per square foot.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace